Revit 2027 API
CoordinationModelLinkData.ProjectId Property
 The id in the Data Management API of the Autodesk Docs project where the model view defining this Coordination Model link is found.
 For a Coordination Model from Autodesk Docs, ProjectId is the id in the Data Management API of the Autodesk Docs project where the model view is found.
 For a local Coordination Model, ProjectId has an empty value.
Namespace: Autodesk.Revit.DB.ExternalData
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string ProjectId { get; }
Public ReadOnly Property ProjectId As String
	Get
public:
property String^ ProjectId {
	String^ get ();
}
member ProjectId : string with get
Property Value
String
See Also
Reference
CoordinationModelLinkData Class
Autodesk.Revit.DB.ExternalData Namespace